<?php
if ($_POST['sub_project'] == '01_辦公租賃費') {
    $a = ['00_其他', '01_固定租金', '02_營業抽成', '03_物業管理費'];
} else if ($_POST['sub_project'] == '02_水電瓦斯費') {
    $a = ['00_其他', '01_電費', '02_瓦斯費', '03_水費'];
} else if ($_POST['sub_project'] == '03_會計記帳費') {
    $a = ['00_其他', '01_記帳費', '02_營業稅'];
} else if ($_POST['sub_project'] == '04_郵電網路費') {
    $a = ['00_其他', '01_電話費', '02_網路費', '03_郵資'];
} else if ($_POST['sub_project'] == '06_文書運雜費') {
    $a = ['00_其他', '01_設計印刷費', '02_運費', '03_餐費', '04_垃圾清運費'];
} else if ($_POST['sub_project'] == '07_交通差旅費') {
    $a = ['00_其他', '01_交通費', '02_住宿費', '03_誤餐費', '04_其他'];
} else if ($_POST['sub_project'] == '08_營業材料費') {
    $a = ['00_其他', '01_食材', '02_包材'];
} else if ($_POST['sub_project'] == '09_設備維養費') {
    $a = ['00_其他', '01_裝潢設備費', '02_餐具費', '03_維修保養費', '04_備品耗材制服費'];
} else if ($_POST['sub_project'] == '01_業務開發費') {
    $a = ['00_其他', '01_交通費', '02_住宿費', '03_設計印刷費'];
} else if ($_POST['sub_project'] == '02_公關交際費') {
    $a = ['00_其他', '01_公關餐費', '02_公關禮品'];
} else if ($_POST['sub_project'] == '01_基本薪資') {
    $a = ['00_其他', '01_基本薪資'];
} else if ($_POST['sub_project'] == '02_勞健退費用') {
    $a = ['00_其他', '01_勞保費', '02_健保費', '03_勞退金'];
} else if ($_POST['sub_project'] == '03_專案津貼') {
    $a = ['00_其他', '01_專案獎金', '02_營業獎金', '03_營利分潤'];
} else if ($_POST['sub_project'] == '01_福利感謝金') {
    $a = ['00_其他', '01_三節獎金', '02_祝賀慰勞金'];
} else if ($_POST['sub_project'] == '02_團隊福利活動') {
    $a = ['00_其他', '01_聚餐費', '02_訓練活動費', '03_旅遊補助費'];
}

echo json_encode($a);
